Revit 2027 API
BuiltInFailures.RebarFailures.SketchFreeFormSet Property
 Sketching of a free form set produces only a single bar.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SketchFreeFormSet { get; }
Public Shared ReadOnly Property SketchFreeFormSet As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SketchFreeFormSet {
	FailureDefinitionId^ get ();
}
static member SketchFreeFormSet : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace